"Continue" = "Jatka";

"Software Update" = "Ohjelmiston päivitys";
"Release Notes:" = "Julkaisutiedot:";
"Remind Me Later" = "Muistuta mimua myöhemmin";
"Install on Quit" = "Asenna lopetettaessa";
"Install and Relaunch" = "Aenna ja käynnistä uudelleen";
"Skip This Version" = "Ohita tämä versio";

"Automatically download and install updates" = "Automatically download and install updates";
"No newer version available." = "Ei uudempaa versiota saatavilla.";
"An error occurred in retrieving update information. Please try again later." = "Päivitystietojen hakemisessa tapahtui virhe. Yritä uudelleen myöhemmin.";
"A new version of {0} is available! Would you like to download it now?" = "Uusi version {0} on saatavilla! Haluatko ladata sen nyt?";

/* Progress messages */
"Installing update…" = "Asennan päivityksen…";
"Checking for updates…" = "Tarkistan päivityksiä…";
"Downloading update…" = "Lataan päivityksen…";
"Extracting update…" = "Puran päivityksen…";

"Version {0} is now available" = "Versio {0} on nyt saatavilla";
